backend/models/Login.php

SELECT * FROM `login` WHERE `username`='developer'
---
    public static function findByUsername($username)
    {
        return self::findOne(['username' => $username]);